moving docs to mermaid instead of plantuml (because of automatic github support)
